БухЭксп/Documents/CW_РеализацияПрочихТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_РеализацияПрочихТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗачетаАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗадолженности</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскийКурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРеализации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СрокиОплатыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СрокиОплатыСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокРасчетаДляУсловияОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокРасчетаДляУсловияОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыПолученияПередачиСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыВозвратаАкта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокПрисвоенияИсходящихНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокПрисвоенияИсходящихНомеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СплошнаяНумерация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПределахДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезависимаяНумерация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПределахДатыАктыНезависимые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийНумератор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_РеализацияПрочихТоваровУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	СтруктураПланаОплаты= CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
	СтруктураПланаОплаты.Свойство("Дата",		ПланОплаты);
	СтруктураПланаОплаты.Свойство("Примечание",	ПланОплатыОписание);
	
	УстановитьОформлениеПланаОплаты();
	
	ЭтоНовыйОбъект = Параметры.Ключ.Пустая();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация	 = ОбщегоНазначенияБПВызовСервера.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		СформироватьПредставлениеКурсаВалютыДокумента();
	КонецЕсли;
	
	УстановитьВидимостьКурсаВалюты();
	
	ОбновитьТекстПакетаДокументов();
	
	УстановитьУсловноеОформление();	 
	
	//Срок оплаты
	Если Не Параметры.Ключ.Пустая() Тогда
		ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Параметры.Ключ);
		
		ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
		ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
		ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
		
	КонецЕсли;
	
	УстановитьОписаниеСрокаОплаты();	
	//Срок оплаты
	
	//Подсистема.ДополнительныеРеквизиты
	ИспользоватьДопРеквизиты = CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты();
	//Подсистема.ДополнительныеРеквизиты
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", НЕ ИспользоватьДопРеквизиты); 
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ОригиналыДокументов

	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов

	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	//Внешние подклчюаемые команды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДобавленныеКолонкиТаблиц("Услуги");
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	Если ИспользоватьДопРеквизиты Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКурсаВалюты()
	
	Элементы.КурсВалюты.Видимость = ЗначениеЗаполнено(Объект.ВалютаДокумента) и Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	
	//Наличие прикрепленных файлов
	Если ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
	
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
	//Наличие прикрепленных файлов
		
	//Подсистема.СтатусыДокументов
	ИначеЕсли ИмяСобытия = "Изменение_СтатусДокумента" Тогда
		
		ОбработатьОповещениеИзменениеСтатусДокументаНаСервере();
	//Подсистема.СтатусыДокументов
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//СрокОплаты
	Если ЭтоНовыйОбъект Тогда
		Если Не _СрокОплатыРучноеРедактирование Тогда
			РасчитатьСрокОплатыДокумента();
		Иначе
			ЗаписатьСрокОплатыДокумента();
		КонецЕсли;
	КонецЕсли;
	УстановитьОписаниеСрокаОплаты();             
	//СрокОплаты

	ЗаполнитьДобавленныеКолонкиТаблиц("Услуги");

	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ОригиналыДокументов

	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	ЭтоНовыйОбъект = Ложь;
КонецПроцедуры


&НаСервере
Процедура ЗаписатьСрокОплатыДокумента() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Счет", 					Объект.Ссылка);
	СтруктураПараметров.Вставить("ДатаОплаты", 				_СрокОплаты);
	СтруктураПараметров.Вставить("Описание", 				_СрокОплатыОписание);
	СтруктураПараметров.Вставить("РучноеРедактирование", 	_СрокОплатыРучноеРедактирование);

	РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметров); 

КонецПроцедуры

&НаСервере
Процедура РасчитатьСрокОплатыДокумента()
	
	Если Объект.Ссылка.Пустая() или _СрокОплатыРучноеРедактирование Тогда
		//или ЗначениеЗаполнено(_СрокОплаты) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", 		?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	СтруктураПараметров.Вставить("Договор", 	Объект.Договор);
	СтруктураПараметров.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	
	УсловияОплаты = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "УсловияОплаты");
	ПорядокРасчетаСрокаОплаты = УсловияОплаты.ПорядокРасчета;
	
	Если Объект.ФормируетсяСчет и Не Объект.ФормируетсяАкт 
		и ПорядокРасчетаСрокаОплаты = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		Возврат;
	Конецесли;	
	
	СтруктураДанных = CW_Документы.ПодготовитьДанныеДляРасчетаСрокаОплаты(Объект);
	_СрокОплаты 	= CW_Документы.РассчитатьСрокОплаты(СтруктураДанных);
	
	ЗаписатьСрокОплатыДокумента();

КонецПроцедуры


&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСерввере();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСерввере()   
	
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				=  ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	СтруктураПараметровДоговора.Договор 			= Объект.Договор;
	СтруктураПараметровДоговора.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	ПараметрыДоговора		= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора, "ИспользуетсяУниверсальныйДокумент");
	
	Объект.ВалютаДокумента = CW_УчетПриложенийДоговоровСервер.ПолучитьВалютуПриложенияДОговора(Объект.ПриложениеКДоговору, Объект.Договор);
	
	СтруктураКурса 		= CW_Финансы.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	Объект.КурсВзаиморасчетов 		= СтруктураКурса.Курс;
	Объект.КратностьВзаиморасчетов 	= СтруктураКурса.Кратность;
	
	Объект.ЭтоУниверсальныйДокумент = ПараметрыДоговора.ИспользуетсяУниверсальныйДокумент;

	УстановитьВидимостьКурсаВалюты();
	
	СформироватьПредставлениеКурсаВалютыДокумента();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мВидыДоговоров = новый Массив;
	мВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	мВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"));
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВидДоговора", мВидыДоговоров);
	СтруктураОтбора.Вставить("Владелец", 	Объект.Контрагент);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор", 				 СтруктураОтбора);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе",  Истина);
	ПараметрыФормыВыбора.Вставить("РежимВыбора", 		 Истина);
	
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора", ПараметрыФормыВыбора, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеКурсаВалютыДокумента()
	
	КурсВалюты = Строка(Объект.ВалютаДокумента)+ " = " + Формат(Объект.КурсВзаиморасчетов, "ЧДЦ=3");
	
КонецПроцедуры


&НаКлиенте
Процедура КурсВалютыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКурса", ЭтотОбъект); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПользовательскийКурс", Объект.ПользовательскийКурсВзаиморасчетов);
	ПараметрыФормы.Вставить("Курс", 				Объект.КурсВзаиморасчетов);
	ПараметрыФормы.Вставить("Кратность", 			Объект.КратностьВзаиморасчетов);
	ПараметрыФормы.Вставить("ДатаКурса", 			?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	ПараметрыФормы.Вставить("Валюта", 				Объект.ВалютаДокумента);
	ПараметрыФормы.Вставить("РасчетыВУЕ", 			ПолучитьПризнакВзаиморасчетовВУсловныхЕдиницах(Объект.Договор));
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКурсаДляУсловныхЕдиниц",ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПризнакВзаиморасчетовВУсловныхЕдиницах(Договор)
	
	Возврат Договор.ВзаиморасчетыВУЕ;

КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораКурса(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПользовательскийКурсВзаиморасчетов 	=  РезультатВыбора.ПользовательскийКурс;
	Объект.КурсВзаиморасчетов 					=  РезультатВыбора.Курс;
	Объект.КратностьВзаиморасчетов 				=  РезультатВыбора.Кратность;
	
	СформироватьПредставлениеКурсаВалютыДокумента();
	
КонецПроцедуры


//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	ДоговорПриИзмененииНаСерввере();
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()

	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов 

//Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры
//Подсистема.СтатусыДокументов

//Подсистема.ОригиналыДокументов
&НаКлиенте
Процедура ОригиналыПредоставленыПриИзменении(Элемент)
	
	ОригиналыПредоставленыПриИзмененииНаСервере();
	
КонецПроцедуры

&Насервере
Процедура ОригиналыПредоставленыПриИзмененииНаСервере()
	
	CW_ОригиналыДокументовСервер.ОригиналыПредоставленыПриИзмененииНаСервере(ЭтаФорма) ;
	
	Если НЕ Объект.Договор.Пустая() Тогда
		РасчитатьСрокОплатыДокумента();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаНажатие(Элемент, СтандартнаяОбработка)
	
	CW_ОригиналыДокументовКлиент.ОткрытьФормуВводаДаты(ЭтаФорма,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(НоваяДата, Параметры) Экспорт
	
	Если НЕ НоваяДата = Неопределено Тогда
		ОбработатьИзменениеДатыВозвратаОригиналовДокументов(НоваяДата);
		
		Если НЕ Объект.Договор.Пустая() Тогда
			РасчитатьСрокОплатыДокумента();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДатыВозвратаОригиналовДокументов(НоваяДата)
	
	CW_ОригиналыДокументовСервер.ОбработатьИзменениеДатыВозвратаОригиналовДокументов(ЭтаФорма, НоваяДата);

КонецПроцедуры
//Подсистема.ОригиналыДокументов

//Внешние подклчюаемые команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры
//Внешние подклчюаемые команды

//Форма пакета документов
&НаКлиенте
Процедура СрокОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыСрокаОплаты = Новый Структура;
	ПараметрыФормыСрокаОплаты.Вставить("Документ", 				Объект.Ссылка); 
	
	ПараметрыФормыСрокаОплаты.Вставить("ДатаОплаты",			_СрокОплаты);
	ПараметрыФормыСрокаОплаты.Вставить("Описание",				_СрокОплатыОписание);
	ПараметрыФормыСрокаОплаты.Вставить("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеСрокаОплаты",ЭтотОбъект); 

	ОткрытьФорму("ОбщаяФорма.CW_СрокОплаты", ПараметрыФормыСрокаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСрокаОплаты(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыбора.Свойство("ДатаОплаты",   		 _СрокОплаты);
	РезультатВыбора.Свойство("Описание",  			 _СрокОплатыОписание);
	РезультатВыбора.Свойство("РучноеРедактирование", _СрокОплатыРучноеРедактирование); 
	
	Если Не РезультатВыбора.РучноеРедактирование Тогда
		РасчитатьСрокОплатыДокумента();
	КонецЕсли;
	
	ЗаписатьСрокОплатыДокумента();  
	УстановитьОписаниеСрокаОплаты();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеСрокаОплаты()

	Текст = "<не установлен>";
	
	Если ЗначениеЗаполнено(_СрокОплаты) Тогда
		Текст = Формат(_СрокОплаты,"ДФ=dd.MM.yyyy");
		Если СокрЛП(_СрокОплатыОписание) <> "" Тогда
			Текст = Текст + " ("+СокрЛП(_СрокОплатыОписание)+")";
		КонецЕсли; 
	Иначе
		Если Не _СрокОплатыРучноеРедактирование Тогда
			Текст = "<авто>";
		КонецЕсли; 
	КонецЕсли;	
	
	СрокОплаты = Текст;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "План оплаты можно установить только для записанного документа.");
	Иначе
		
		Представление = "Счёт №"+СокрЛП(Объект.НомерСчета)+" от "+Формат(Объект.ДатаСчета,"ДФ=dd.MM.yyyy")+" ("+Строка(Объект.Контрагент)+")";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПланаОплаты",ЭтотОбъект); 
		
		ПараметрыФормыПланаОплаты = Новый Структура;
		ПараметрыФормыПланаОплаты.Вставить("Документ", Объект.Ссылка);
		ПараметрыФормыПланаОплаты.Вставить("ПредставлениеДокумента", Представление);
		
		ОткрытьФорму("ОбщаяФорма.CW_ПлановыйСрокОплаты",ПараметрыФормыПланаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПланаОплаты(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОформлениеПланаОплаты();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОформлениеПланаОплаты()
	
	Текст = "<не установлен>"; 
	
	ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
	Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = "<...>";
	ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
		Текст = Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = Текст + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
	КонецЕсли; 
	
	ПланОплаты = Текст;

	ОбновитьТекстПакетаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыСнятьВсе(Команда)
	
	ОбработатьФлагиПервичныхДокументов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыУстановитьВсе(Команда)
	
	ОбработатьФлагиПервичныхДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормируетсяСчетПриИзменении(Элемент)
	
	ФормируетсяСчетПриИзмененииНаСервере();
	УстановитьДоступностьРеквизитовПакетаДокументов();
	ОбновитьТекстПакетаДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ФормируетсяСчетПриИзмененииНаСервере()
	
	Если Не Объект.ФормируетсяСчет Тогда
		Объект.НомерСчета = "";
		Объект.ДатаСчета = "";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ФормируетсяАктПриИзменении(Элемент)
	
	ФормируетсяАктПриИзмененииНаСервере();
	УстановитьДоступностьРеквизитовПакетаДокументов();
	ОбновитьТекстПакетаДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ФормируетсяАктПриИзмененииНаСервере()
	
	Если Не Объект.ФормируетсяАкт Тогда
		Объект.НомерАкта = "";
		Объект.ДатаАкта = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоУниверсальныйДокументПриИзменении(Элемент)
	ОбновитьТекстПакетаДокументов();
КонецПроцедуры


&НаКлиенте
Процедура ФормируетсяСчетФактураПриИзменении(Элемент)
	
	ФормируетсяСчетФактураПриИзмененииНаСервере();
	УстановитьДоступностьРеквизитовПакетаДокументов();
	ОбновитьТекстПакетаДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ФормируетсяСчетФактураПриИзмененииНаСервере()
	
	Если Не Объект.ФормируетсяСчетФактура Тогда
		Объект.НомерСчетаФактуры = "";
		Объект.ДатаСчетаФактуры = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлагиПервичныхДокументов(Флаг)
	
	Объект.ФормируетсяАкт 			= Флаг;
	Объект.ФормируетсяСчет 			= Флаг;
	Объект.ФормируетсяСчетФактура 	= Флаг;
	
	ФормируетсяСчетПриИзмененииНаСервере();
	ФормируетсяАктПриИзмененииНаСервере();
	ФормируетсяСчетФактураПриИзмененииНаСервере();
	
	УстановитьДоступностьРеквизитовПакетаДокументов();
	ОбновитьТекстПакетаДокументов();

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьРеквизитовПакетаДокументов()
	
	Элементы.НомерСчета.Доступность = Объект.ФормируетсяСчет;
	Элементы.ДатаСчета.Доступность  = Объект.ФормируетсяСчет;
	
	Элементы.СпособЗачетаАванса.Доступность  	= Объект.ФормируетсяСчет;
	Элементы.СрокОплаты.Доступность  			= Объект.ФормируетсяСчет;
	Элементы.ПланОплаты.Доступность  			= Объект.ФормируетсяСчет;
	
	Элементы.НомерАкта.Доступность = Объект.ФормируетсяАкт;
	Элементы.ДатаАкта.Доступность  = Объект.ФормируетсяАкт;
	Элементы.ЭтоУниверсальныйДокумент.Доступность  = Объект.ФормируетсяАкт;
	
	Элементы.НомерСчетаФактуры.Доступность = Объект.ФормируетсяСчетФактура;
	Элементы.ДатаСчетаФактуры.Доступность  = Объект.ФормируетсяСчетФактура;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстПакетаДокументов()
	
	ЭтоУПД = Объект.ФормируетсяАкт и Объект.ЭтоУниверсальныйДокумент;
	
	Элементы.НадписьУПД.Видимость 			= ЭтоУПД;
	Элементы.НадписьСчетФактура.Видимость 	= НЕ ЭтоУПД;
	Элементы.НадписьАкт.Видимость 			= НЕ ЭтоУПД;
	
	
	Если Объект.ФормируетсяСчет Тогда
		
		Если ЗначениеЗаполнено(Объект.НомерСчета) Тогда
			ПредставлениеНомераСчета = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчета, Объект.ДатаСчета));	 
		Иначе
			ПредставлениеНомераСчета = "<...>";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
			ПредставлениеДатыСчета	= Формат(Объект.ДатаСчета, "ДФ=dd.MM.yyyy");
		Иначе
			ПредставлениеДатыСчета 	= "<...>";	
		КонецЕсли;
		
		//План оплаты
		ПредставлениеСрокаОплаты = "";
		ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
		Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: <...>";
		ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: "+Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ПредставлениеСрокаОплаты + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
		КонецЕсли; 
		//План оплаты
		
		Элементы.НадписьСчет.Заголовок = "Счёт №"+ ПредставлениеНомераСчета+ " от " + ПредставлениеДатыСчета + ПредставлениеСрокаОплаты;
		
	Иначе
		Элементы.НадписьСчет.Заголовок = "<Счёт не предоставлен>"; 
	КонецЕсли;
	
	
	Если Не ЭтоУПД Тогда
		Если Объект.ФормируетсяАкт Тогда 
			Если ЗначениеЗаполнено(Объект.НомерАкта) Тогда
				ПредставлениеНомераАкта = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерАкта, Объект.ДатаАкта));	 
			Иначе
				ПредставлениеНомераАкта = "<...>";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
				ПредставлениеДатыАкта  = Формат(Объект.ДатаАкта, "ДФ=dd.MM.yyyy");
			Иначе
				ПредставлениеДатыАкта = "<...>";	
			КонецЕсли;
			
			Элементы.НадписьАкт.Заголовок = "Акт №" + ПредставлениеНомераАкта + " от " + ПредставлениеДатыАкта;

		Иначе
			Элементы.НадписьАкт.Заголовок = "<Акт не предоставлен>"; 
		КонецЕсли;
		
		Если Объект.ФормируетсяСчетФактура Тогда 
			Если ЗначениеЗаполнено(Объект.НомерСчетаФактуры) Тогда
				ПредставлениеНомераСчетФактура = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчетаФактуры, Объект.ДатаСчетаФактуры));	 
			Иначе
				ПредставлениеНомераСчетФактура = "<...>";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ДатаСчетаФактуры) Тогда
				ПредставлениеДатыСчетФактура 	 = Формат(Объект.ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");
			Иначе
				ПредставлениеДатыСчетФактура = "<...>";	
			КонецЕсли;    
			
			Элементы.НадписьСчетФактура.Заголовок  = "С/ф №" + ПредставлениеНомераСчетФактура + " от " + ПредставлениеДатыСчетФактура;
		Иначе
			Элементы.НадписьСчетФактура.Заголовок = "<С/Ф не предоставлен>"; 
		КонецЕсли;
	КонецЕсли; 
	
	Если ЭтоУПД Тогда   
		
		ВидУПД = "УПД";
		
		Если Объект.ФормируетсяСчетФактура Тогда  
			СтатусУПД 				= "(1)";
			ПредставлениеНомераУПД	= CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчетаФактуры, Объект.ДатаСчетаФактуры));
			ПредставлениеНомераУПД	= " №"+ ?(ПустаяСтрока(ПредставлениеНомераУПД), "<...>", 	ПредставлениеНомераУПД);
			ПредставлениеДатыУПД 	= ?(Объект.ДатаСчетаФактуры = Дата(1,1,1),				  "<...>",	Формат(Объект.ДатаСчетаФактуры,"ДФ=dd.MM.yyyy"));
		Иначе
			СтатусУПД 				= "(2)";
			ПредставлениеНомераУПД	= CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерАкта, Объект.ДатаАкта));
			ПредставлениеНомераУПД	= " №"+ ?(ПустаяСтрока(ПредставлениеНомераУПД), "<...>", 	ПредставлениеНомераУПД);
			ПредставлениеДатыУПД 	= ?(Объект.ДатаАкта = Дата(1,1,1),				"<...>",Формат(Объект.ДатаАкта,"ДФ=dd.MM.yyyy"));
		КонецЕсли;  
		
		ПредставлениеУПД = ВидУПД + СтатусУПД + ПредставлениеНомераУПД + " от "+ ПредставлениеДатыУПД;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСрокОплаты(Команда)   
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Документ не записан!");
		Возврат;
	КонецЕсли;
	
	КомандаУстановитьСрокОплатыНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаУстановитьСрокОплатыНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка"		, Объект.Ссылка);
	СтруктураПараметров.Вставить("Договор"		, Объект.Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	Если ЗначениеЗаполнено( Объект.ПриложениеКДоговору) Тогда
		СтруктураПараметров.Вставить("Договор"		, Объект.ПриложениеКДоговору);
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	СтруктураПараметров.Вставить("Дата"			, Объект.Дата);
	СтруктураПараметров.Вставить("ДатаСчета"	, Объект.ДатаСчета);
	СтруктураПараметров.Вставить("ЕстьСчет"		, Объект.ФормируетсяСчет);
	СтруктураПараметров.Вставить("ЕстьАкт"		, Объект.ФормируетсяАкт);
	
	СрокОплаты = CW_Документы.РассчитатьСрокОплаты(СтруктураПараметров);
	
	УстановитьОписаниеСрокаОплаты();
	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	// если очистили номер документа, то очистим дату счета
	Если Не ЗначениеЗаполнено(Объект.НомерСчета) Тогда
		Объект.ДатаСчета = Дата(1,1,1);
	Иначе // значение номера не пустое
		// дата счета по умолчанию ставим дате документа
		Если Объект.ДатаСчета = Дата(1,1,1) Тогда
			Объект.ДатаСчета = Объект.Дата;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьТекстПакетаДокументов();

КонецПроцедуры

&НаКлиенте
Процедура НомерАктаПриИзменении(Элемент)
	
// значение номера пустое	
	Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
		Объект.ДатаАкта = Дата(1,1,1);
	Иначе  // значение номера не пустое
		
		// Если заполнили номер документа, а дата пустая, 
		// то установим ее равной дате документа
		// значение номера не пустое
		Если Объект.ДатаАкта = Дата(1,1,1) Тогда
			Объект.ДатаАкта = Объект.Дата;			
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьТекстПакетаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетФактурыПриИзменении(Элемент)
	
	// если очистили номер документа, то очистим дату с/ф, 
	// т.к. в этом случае дата с/ф будет принудительно сформирована на основании даты акта
	Если Не ЗначениеЗаполнено(Объект.НомерСчетаФактуры) Тогда
		Объект.ДатаСчетаФактуры = Дата(1,1,1);
	Иначе 	// номер заполнили 
		
		// дата с/ф должна совпадать с датой акта или датой документа (в случае отсутствия акта)
		Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
			Если Объект.ДатаАкта = Дата(1,1,1) Тогда
				Объект.ДатаСчетаФактуры = Объект.Дата;
			Иначе
				Объект.ДатаСчетаФактуры = Объект.ДатаАкта;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьТекстПакетаДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаПриИзменении(Элемент)
	
	// если очистили дату с/ф, то принудительно очистим номер документа
	Если Объект.ДатаСчета = Дата(1,1,1) Тогда
		Объект.НомерСчета = "";
	КонецЕсли;
	
	ОбновитьТекстПакетаДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ДатаАктаПриИзменении(Элемент)
	
	// если очистили дату акта, то принудительно очистим номер документа,
	Если Объект.ДатаАкта = Дата(1,1,1) Тогда
		Объект.НомерАкта = "";
	КонецЕсли;
	
	ОбновитьТекстПакетаДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаФактурыПриИзменении(Элемент)

	// если очистили дату с/ф, то принудительно очистим номер документа
	Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
		Объект.НомерСчетаФактуры = "";
		Возврат;
	КонецЕсли;
	
	ОбновитьТекстПакетаДокументов();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользуетсяПакетнаяНумерацияНаСервере(Дата, Организация)
	
	ПорядокПрисвоенияНомеров = CW_Настройки.ПараметрУчетнойПолитики(Дата, Организация,"ПорядокПрисвоенияНомеров");
	
	Возврат ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты") ИЛИ
			ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация"); 
	
КонецФункции

&НаКлиенте
Процедура ПервичныеДокументыВремяСчета(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата счета!",,"ДатаСчета", "Объект");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НачальнаяДата",	Объект.ДатаСчета);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ДатаСчета");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияВремени",ЭтотОбъект, ДополнительныеПараметры); 
	
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаСчета,"Время счёта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВремяАкта(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата акта!",,"ДатаАкта", "Объект");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НачальнаяДата",	Объект.ДатаАкта);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ДатаАкта");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияВремени",ЭтотОбъект, ДополнительныеПараметры); 
	
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаАкта,"Время акта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияВремени(ВведенноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВведенноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСтрокой	 = Формат(Объект[ДополнительныеПараметры.ИмяРеквизита],"ДФ=yyyyMMdd");
	ВремяСтрокой = Формат(ВведенноеЗначение,"ДФ=HHmmss");

	Объект[ДополнительныеПараметры.ИмяРеквизита] = Дата(ДатаСтрокой+ВремяСтрокой);
	
КонецПроцедуры
//Форма пакета документов

//Табличная часть Услуги
&НаКлиенте
Процедура УслугиОчистить(Команда)
	
	Если Объект.Услуги.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПродолжитьОчисткуТабличнойЧасти", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОчисткуТабличнойЧасти(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Объект.Услуги.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", 	Истина);
	ПараметрыФормы.Вставить("закрыватьПриВыборе", 	Истина);

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаВыбора" Тогда
		
		Для Каждого ВыбраннаяНоменклатура из ВыбранноеЗначение Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", ВыбраннаяНоменклатура);
			мСтроки = Объект.Услуги.НайтиСтроки(Отбор);
			
			Если мСтроки.Количество() > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура "+Строка(ВыбраннаяНоменклатура) + " уже есть в списке");
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.Услуги.Добавить();
			НоваяСтрока.Номенклатура = ВыбраннаяНоменклатура;
			
			ЗаполнитьДанныеСтрокиНаСервере(НоваяСтрока.ПолучитьИдентификатор());
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	ЗаполнитьДанныеСтрокиНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтрокиНаСервере(ИдентифкаторСтроки)
	
	СтрокаТекущая = Объект.Услуги.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	Если ЗначениеЗаполнено(СтрокаТекущая.Номенклатура) Тогда 
		
		СтрокаТекущая.ПредставлениеНоменклатуры = СтрокаТекущая.Номенклатура.НаименованиеПолное;
		
		// пересчет суммовых показателей осуществляем, только при изменении ставки НДС
		СтавкаНДСНоменклаутры =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(СтрокаТекущая.Номенклатура, Объект.Дата);
		Если СтрокаТекущая.СтавкаНДС <> СтавкаНДСНоменклаутры Тогда
			СтрокаТекущая.СтавкаНДС = СтавкаНДСНоменклаутры;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область МСФО

&НаКлиенте
Процедура УслугиСчетРеализацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	Для Сч = 1 По 3 Цикл
		ТекущиеДанные["Субконто"+ Сч] = Неопределено;
	КонецЦикла;
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоСтрокиПриИзмененииСчета(
		ЭтотОбъект, ТекущиеДанные, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
	
	ПараметрыОбъекта = Неопределено;
	ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(ЭтаФорма, ПараметрыОбъекта);
	
	ЗаполнитьДобавленныеКолонкиСтрокиТаблицыУслуги(ТекущиеДанные, ПараметрыОбъекта);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(Знач Форма, ПараметрыОбъекта)

	Объект = Форма.Объект;
	
	Если ТипЗнч(ПараметрыОбъекта) <> Тип("Структура") Тогда
		ПараметрыОбъекта = Новый Структура;
	КонецЕсли;
	
	ПараметрыОбъекта.Вставить("СуммаВключаетНДС", Ложь);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицыУслуги(СтрокаТаблицы, Знач ПараметрыОбъекта)
	
	УчетПоПодразделениям = Неопределено;
	Если СтрокаТаблицы.Свойство("СчетЗатрат") Тогда
		
		СвойстваСчетаБУ = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетЗатрат);
		
		УчетПоПодразделениям = СвойстваСчетаБУ.УчетПоПодразделениям;
		
	КонецЕсли;
	
	Если УчетПоПодразделениям <> Неопределено Тогда
		СтрокаТаблицы.ПодразделениеДоступность = УчетПоПодразделениям;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТабличнойЧасти)
	
	
	ПараметрыОбъекта = Неопределено;
	ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(ЭтаФорма, ПараметрыОбъекта);
	
	Если ПустаяСтрока(ИмяТабличнойЧасти) ИЛИ ИмяТабличнойЧасти = "Услуги" Тогда
		
		Для Каждого СтрокаТаблицы Из Объект.Услуги Цикл
			ЗаполнитьДобавленныеКолонкиСтрокиТаблицыУслуги(СтрокаТаблицы, ПараметрыОбъекта);
		КонецЦикла;
		
		CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьНачальныеСвойстваСубконтоТаблицы(
		Объект.Услуги, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствСубконто(Форма)

	Результат = CW_БухгалтерскийУчетКлиентСерверМСФО.ПараметрыУстановкиСвойствСубконтоПоШаблону(
		"УслугиСубконто", "УслугиПодразделение", "Субконто", "ПодразделениеОрганизации", "СчетРеализации");
		
	Результат.ПоляОбъекта.Вставить("ПодразделениеДоступность", "ПодразделениеДоступность");
	
	Результат.ЗначенияПоУмолчанию.Вставить(
		ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ВидыСубконтоМСФО.СтатьиЗатрат"),
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатьиЗатрат.ПрочиеЗатраты"));
	Результат.ЗначенияПоУмолчанию.Вставить(
		ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ВидыСубконтоМСФО.ПрочиеДоходыИРасходы"),
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ПрочиеВнереализационныеДоходыРасходы"));
	
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);
	Результат.СкрыватьСубконто = Ложь;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Субконто БУ и НУ
	// Первое субконто не скрываем, чтобы не мигала колонка в разных строках.
	
	Для Сч = 1 По 3 Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиСубконто" + Сч);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Услуги.Субконто" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	КонецЦикла;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиПодразделениеОрганизации");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.ПодразделениеДоступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Субконто БУ
	// Первое субконто не скрываем, чтобы не мигала колонка в разных строках.
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиСубконто1");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.Субконто1Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.Субконто2Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.Субконто3Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ПриИзмененииКоличествоЦена(Элементы.Услуги.ТекущаяСтрока, 1);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ПриИзмененииКоличествоЦена(Элементы.Услуги.ТекущаяСтрока, 1);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	ПриИзмененииСумма(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	ПриИзмененииСтавкаНДС(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаНДСПриИзменении(Элемент)
	ПриИзмененииСуммаНДС(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиВсегоПриИзменении(Элемент)
	ПриИзмененииВсего(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКоличествоЦена(ИдентификаторСтроки, ЗначениеПустогоКоличества = 0)
	
	СтрокаТабличнойЧасти = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * ?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество);
	
	СтавкаНДС= CW_Финансы.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС 	= CW_Финансы.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма, Истина, Ложь, СтавкаНДС);
	
	СтрокаТабличнойЧасти.Всего 		= СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСумма(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаТабличнойЧасти.Цена = ?(СтрокаТабличнойЧасти.Количество = 0, 0, СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество);
	
	СтавкаНДС	= CW_Финансы.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС 	= CW_Финансы.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма, Истина, Ложь, СтавкаНДС);
	
	СтрокаТабличнойЧасти.Всего 		= СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСуммаНДС(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ОбратныйПересчетВДокументах  = CW_Настройки.ПолучитьНастройкуПользователя(,"ОбратныйПересчетВДокументах");
	
	Если ОбратныйПересчетВДокументах Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Всего - СтрокаТабличнойЧасти.СуммаНДС;
		СтрокаТабличнойЧасти.Цена = ?(СтрокаТабличнойЧасти.Количество = 0, 0, СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество);
	Иначе
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтавкаНДС(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтавкаНДС	= CW_Финансы.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС 	= CW_Финансы.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма, Истина, Ложь, СтавкаНДС);
	
	СтрокаТабличнойЧасти.Всего 		= СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВсего(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтавкаНДС = CW_Финансы.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС)/100;
	
	СтрокаТабличнойЧасти.СуммаНДС 	= СтрокаТабличнойЧасти.Всего * СтавкаНДС / (1 + СтавкаНДС);
	СтрокаТабличнойЧасти.Сумма 		= СтрокаТабличнойЧасти.Всего - СтрокаТабличнойЧасти.СуммаНДС;
	СтрокаТабличнойЧасти.Цена 		= ?(СтрокаТабличнойЧасти.Количество = 0, 0, СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество);

КонецПроцедуры
//Табличная часть услуги
	
#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

&НаКлиенте
Процедура ВидОперации(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами
  	
	//Срок оплаты
	ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Объект.Ссылка);
	ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
	ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
	ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	УстановитьОписаниеСрокаОплаты();
	//Срок оплаты

КонецПроцедуры
